app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(id: "DESC")
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`id` DESC

  def create
    post = Post.create(content: params[:content], checked: false)
---
INSERT INTO `posts` (`content`, `checked`, `created_at`, `updated_at`) VALUES ('大丈夫。。。？', FALSE, '2021-02-15 09:18:18.972274', '2021-02-15 09:18:18.972274')

  def checked

    post = Post.find(params[:id])
    if post.checked
      post.update(checked: false)
    else
      post.update(checked: true)
    end

    item = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
UPDATE `posts` SET `posts`.`checked` = FALSE, `posts`.`updated_at` = '2021-02-15 06:01:26.255630' WHERE `posts`.`id` = 4
UPDATE `posts` SET `posts`.`checked` = TRUE, `posts`.`updated_at` = '2021-02-15 03:48:29.229940' WHERE `posts`.`id` = 2